import os
import time

os.system("clear")
def menu():
    print("""

==================================  """)
print("""\033[9;36m
... █... _______________________________________________.█
... █...    _____________________█______________________.██
... █... ____________▄▄▄▄▄__▄▄▄▄_█__█____█____▄▄▄▄______.░░
... █... ___________█____█__█____█▄█____█_█___█__█_____..███
... █... ___________█____█__████_█__█___█▄▄█__█▄█_____...████
... █... ____________████___▄▄▄█_█___█_█____█_█__█_____..█████
... █... __________________________________________█▄____███████ \033[0;35m
      █================================================█\n           █======================================█\n                  █=========================█\n                        █______________█\n\033[9;36m|||||||||||
                                           |||||||||||||||||||||||||||||||||||\033[0;0m
       
                   \033[1;32m group tele:\033[0;35mhttps://t.me/oskar_go.   \033[1;32m                    
             \033[0;36m  =======================================\033[1;32m
                            Telegram:\033[0;35m@oskarHOme.
              \033[0;36m================ ============= ==== ======                              
                     \033[0;0m◀\033[7;32m<< Enter the item number >>\033[0;0m▶                                                                                                                        
 \033[3;31m[\033[3;32m1\033[3;31m]   \033[3;32m ◀update and repair Termux🔧▶➡ \033[0;0m                                     
\033[3;31m [\033[3;32m0\033[3;31m]   \033[5;32m ◀out.🔌▶⬇\033[0;36m 
... ... ________________________________________________
... ... +++++++++++++++++++++++++++++++++++++++""")
loop = True

while loop:
    menu()
    ht = input(" \033[5;32mnumber: ")
    if ht == "1":
        print("===================================")
        time.sleep(2)
        print("g..")
        print("Download..._ 1:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 2:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 2:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 3:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 4:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 5:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download...._ 6:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 15:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 16:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 17:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 19:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 21:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 25:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 26:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 28:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 30:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 40:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 43:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 45:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 49:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 50:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 55:k.. 10101-[completed]·")
        print("Download..._ 56:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 56:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 58:k.. 10101-[completed]·")
        time.sleep(1)
        print("Download..._ 59:k.. 10101-[completed]·")
        print("""
Download..._ 60:k.. 10101-[completed]·
Download..._ 67:k.. 10101-[completed]·
Download..._ 73:k.. 10101-[completed]·
Download..._ 84:k.. 10101-[completed]·
Download..._ 85:k.. 10101-[completed]·
Download..._ 89:k.. 10101-[completed]·
Download..._ 90:k.. 10101-[completed]·
Download..._ 91:k.. 10101-[completed]·
Download..._ 92:k.. 10101-[completed]·
Download..._ 95:k.. 10101-[completed]·
Download..._ 100:k.. 10101-[completed]·
Download..

Download..._ 10%.. 101 101-[completed]·
Download..._ 10%.. 101 101-[completed]·
Download..._ 10%.. 101 101-[completed]·
Download..._ 10%.. 101 101-[completed]·
Download..._ 10%.. 101 101-[completed]·
Download..._ 10%.. 101 101-[completed]·
Download..._ 10%.. 101 101-[completed]·
Download..._ 10%.. 101 101-[completed]·
Download..._ 10%.. 101 101-[completed]·
Download..._ 10%.. 101 101-[completed]·
Download..._ 10%.. 101 101-[completed]·
Download..._ 10%.. 101 101-[completed]·

Download..._ 20%.. 101 101-[completed]·
Download..._ 20%.. 101 101-[completed]·
Download..._ 20%.. 101 101-[completed]·
Download..._ 20%.. 101 101-[completed]·
Download..._ 20%.. 101 101-[completed]·
Download..._ 20%.. 101 101-[completed]·
Download..._ 20%.. 101 101-[completed]·
Download..._ 20%.. 101 101-[completed]·

Download..._ 30%.. 101 101-[completed]·
Download..._ 30%.. 101 101-[completed]·
Download..._ 30%.. 101 101-[completed]·
Download..._ 30%.. 101 101-[completed]·
Download..._ 30%.. 101 101-[completed]·
Download..._ 30%.. 101 101-[completed]·
Download..._ 30%.. 101 101-[completed]·
Download..._ 30%.. 101 101-[completed]·
Download..._ 30%.. 101 101-[completed]·
Download..._ 30%.. 101 101-[completed]·
Download..._ 30%.. 101 101-[completed]·
Download..._ 30%.. 101 101-[completed]·

Download..._ 40%.. 101 101-[completed]·
Download..._ 40%.. 101 101-[completed]·
Download..._ 40%.. 101 101-[completed]·
Download..._ 40%.. 101 101-[completed]·
Download..._ 40%.. 101 101-[completed]·
Download..._ 40%.. 101 101-[completed]·
Download..._ 40%.. 101 101-[completed]·
Download..._ 40%.. 101 101-[completed]·
Download..._ 40%.. 101 101-[completed]·
Download..._ 40%.. 101 101-[completed]·
Download..._ 40%.. 101 101-[completed]·
Download..._ 40%.. 101 101-[completed]·

Download..._ 50%.. 101 101-[completed]·
Download..._ 50%.. 101 101-[completed]·
Download..._ 50%.. 101 101-[completed]·
Download..._ 50%.. 101 101-[completed]·
Download..._ 50%.. 101 101-[completed]·
Download..._ 50%.. 101 101-[completed]·
Download..._ 50%.. 101 101-[completed]·
Download..._ 50%.. 101 101-[completed]·
Download..._ 50%.. 101 101-[completed]·
Download..._ 50%.. 101 101-[completed]·
Download..._ 50%.. 101 101-[completed]·
Download..._ 50%.. 101 101-[completed]·
Download..._ 50%.. 101 101-[completed]·
Download..._ 50%.. 101 101-[completed]·

Download..._ 60%.. 101 101-[completed]·
Download..._ 60%.. 101 101-[completed]·
Download..._ 60%.. 101 101-[completed]·

Download..._ 70%.. 101 101-[completed]·
Download..._ 70%.. 101 101-[completed]·
Download..._ 70%.. 101 101-[completed]·

Download..._ 80%.. 101 101-[completed]·
Download..._ 80%.. 101 101-[completed]·
Download..._ 80%.. 101 101-[completed]·
Download..._ 80%.. 101 101-[completed]·

Download..._ 90%.. 101 101-[completed]·
Download..._ 90%.. 101 101-[completed]·
Download..._ 90%.. 101 101-[completed]·

Download..._ 100%.. 101 101-[completed]·
|==============>|||||% \033[0;0m

   =================================                                  
                   \033[2;32m    ██████████████████████████   
              /  ██████░▀██████████████▀░█████\ 
         / ███████▌▒▒░███    Oskar    ██░▒▒▐██████\ 
       /████████░▒▒▒░██████████░▒▒▒░███████\ 
    / ████████▌░▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒░▐███████\ 
  /█████████░▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒░████████ 
    ██████████▀▀▀██▄▒▒▒▒▒▒▒▄█▀▀▀█████████\    
 █████████ ░░░▐█░▀█▒▒▒▒▒█▀░█▌░░░░█████
  █████████░░░▐▄▌░▐▌▒▒▒▐▌░▐▄▌░░ █████
  █████████ ░░░▐█▌░░▌▒▒▒▐░░▐█▌░░ ████████ 
   ████████▒▀▄▄▄█▄▄▄▌░▄░▐▄▄▄█▄▄▀▒████████/ 
  \█████████░░░░░░░░░└┴┘░░░░░░░░█████████ 
    \██████████▄▄░░░░░░░░░░░░░░▄▄█████████/ 
       \███████████████▒▒▒▒▒▒██████████████/ 
          \███████▀░░███▒▒░░▒░░▒▀███████████/ 
            \ ██████▒░███▒▒╖░░╥░░╓▒▐█████████/ 
               \ █████▒░▀▀▀░░║░░║░░║░░████████/ 
                  \ ████▄▄▄▄▀▀┴┴╚╧╧╝╧╧╝┴┴█████/ 
                       \███████████████████████/
__________________________________________________________________
\033[0;0m 
__________________________________________________________________
                              
                  
---------------- """)
        hm = input("[?] Do you want to continue? (y/n): ")
        print("================================")
        if hm == "y":
            print("=================================")
            print("[+] \033[1;31m Please put down you android \033[0;4m")
            print("\033[1;31m DONT CLOSED TERMUX.\033[0;4m")
            print("================================") 
            os.system("termux-setup-storage;cd;dpkg --configure -a;pkg update -y;pkg upgrade -y;pkg install python -y;pkg install python2 -y;pkg install python2-dev -y;pkg install python3 -y;pkg install pip -y;pkg install pip2;pip2 install requests;pkg install fish -y;pkg install ruby -y;pkg install git -y;pkg install dnsutils -y;pkg install php -y;pkg install perl -y;pkg install nmap -y;pkg install bash -y;pkg install clang -y;pkg install nano -y;pkg install w3m -y;pkg install figlet -y;pkg install cowsay -y;gem install lolcat;pkg install curl -y;pkg install tar -y;pkg install zip -y;pkg install unzip -y;pkg install tor -y;pkg install wget -y;pkg install wgetrc -y;pkg install wcalc -y;pkg install bmon -y;pkg install unrar -y;pkg install toilet -y;pkg install proot -y;pkg install golang -y;pkg install chroot -y;termux-chroot -y;pkg install openssl -y;pkg install cmatrix -y;pkg install openssh -y;apt update && apt upgrade -y")
            os.system("clear")            
            print("====================================")
            print("""──────────────────────────── 
───────────██████████─────── 
──────────████████████────── 
──────────██────────██────── 
──────────██▄▄▄▄▄▄▄▄▄█────── 
──────────██▀███─███▀█────── 
█─────────▀█────────█▀────── 
██─────────────────█──────── 
─█─────────────██─────────── 
█▄───────────████─██──████
─▄███████████──██──██████ ── 
────█████████──██──█████████
─────────████──██─█████──███ 
──────────███──██─█████──███
──────────███─────█████████ 
──────────██─────████████▀
────────────██████████ 
────────────██████████
─────────────████████ 
──────────────██████████▄▄
────────────────█████████▀ 
─────────────────████──███
────────────────▄████▄──██ 
────────────────██████───▀
────────────────▀▄▄▄▄▀ 
°°°°  O .S .K .A .R. °°°°°
""")
            print("🔧 The reform is completed.✔")
            print("====================================")
            rmenu = input("❓ Back to Menu? (y/n): ")
            if rmenu == "y":
                menu()
                os.system("clear")
                print("""\033[9;33m
... █... _______________________________________________.█
... █...    _____________________█______________________.██
... █... ____________▄▄▄▄▄__▄▄▄▄_█__█____█____▄▄▄▄______.░░
... █... ___________█____█__█____█▄█____█_█___█__█_____..███
... █... ___________█____█__████_█__█___█▄▄█__█▄█_____...████
... █... ____________████___▄▄▄█_█___█_█____█_█__█_____..█████
... █... __________________________________________█▄____███████ \033[0;35m
      █================================================█\n           █======================================█\n                  █=========================█\n                        █______________█\n\033[9;36m|||||||||||
                                           |||||||||||||||||||||||||||||||||||\033[0;0m
       
                   \033[1;32m group tele:\033[0;35mhttps://t.me/oskar_go.   \033[1;32m                    
             \033[0;36m  =======================================\033[1;32m
                            Telegram:\033[0;35m@oskarHOme.
              \033[0;36m  =============== ============= ==== =======                               
                   \033[7;32m<< Enter the item number >>\033[0;0m                                                                                                                        
 \033[3;31m[\033[3;32m1\033[3;31m ]   \033[3;32m ◀update and repair Termux🔧▶➡ \033[0;0m                                     
\033[3;31m [\033[3;32m0\033[3;31m ]   \033[5;32m ◀out.🔌▶⬇\033[0;36m 
... ... ________________________________________________
... ... +++++++++++++++++++++++++++++++++++++++""")
            else:
                break
    elif ht == "0":
        print("""\033[2;35m 
────────────────────────────
───────────██████████─────── 
──────────████████████────── 
──────────██────────██──────
──────────██▄▄▄▄▄▄▄▄▄█────── 
──────────██▀███─███▀█──────
█─────────▀█────────█▀────── 
██─────────────────█────────
─█─────────────██─────────── 
█▄───────────████─██──████
─▄███████████──██──█████
────█████████──██──█████████
─────────████──██─█████──███
──────────███──██─█████──███
──────────███─────█████████ 
──────────██─────████████▀
────────────██████████ 
────────────██████████
─────────────████████ 
──────────────██████████▄▄
────────────────█████████▀ 
─────────────────████──███
────────────────▄████▄──██ 
────────────────██████───▀
────────────────▀▄▄▄▄▀ 
°°°°  O .S .K .A .R. °°°°°
Good day ◀✔""")
        break
        
